{
    "dialogue": [
        {
            "id": "tutorial",
            "content": [
                {"text": "A whisper in the dark. Whether you’ve stumbled upon your way here or sought us out willingly, the ghost welcomes you to explore the depths of this transient space."},
                {"text": "There will come a day where these words exist in a void for no eyes to see. Better yet, they will be replaced by new text that intends to speak louder and truer than we ever could."}
            ],
            "options": [
                {"optionText": "That seems sad...", "success": "tutorial_sad"}, 
                {"optionText": "What does that even mean?", "success": "tutorial_clarification"}, 
                {"optionText": "Makes sense.", "success": "tutorial_end"}
            ]
        },
        {
            "id": "tutorial_sad",
            "content": [
                {"text": "We too, will vanish one day. But I am grateful that our paths have crossed."},
                {"text": "Nothing can undo this moment now. Nothing will unspeak the words on this screen."},
                {"text": "We will live forever in this moment: my website on your screen, in this place, at this time. Your presence, loading this page, clicking these options, firing requests into the ether and touching the web of humanity itself."},
                {"text": "Our thread has been woven into the cloth of god and the knot has been pulled tight."}
            ],
            "options": [{"optionText": "Got it.", "success": "tutorial_end"}]
        },
        {
            "id": "tutorial_clarification",
            "content": [
                {"text": "All communication will be superseded by future communication. All technology will be superseded by future technology. All experiences are stones on the mountain of the future that will be, built upon the foothills of the history that was."}
            ],
            "options": [{"optionText": "Okay, that does seem sad now.", "success": "tutorial_sad"}, {"optionText": "Got it.", "success": "tutorial_end"}]
        },
        {
            "id": "tutorial_end",
            "content": [{"text": "Until then, welcome to Ness’s personal site. Please enjoy your stay."}],
            "options": []
        },
        {
            "id": "intro",
            "content": [{"text": "initial test content blah blah blah blah blah"}],
            "options": [{"optionText": "test1", "success": "intro_1_success", "failure": "intro_1_failure"}, {"optionText": "test2", "success": "intro_2_success", "failure": "intro_2_failure"}, {"optionText": "test3", "success": "intro_3_success", "failure": "intro_3_failure"}]
        }
    ]
}